In [76]:
import pandas as pd
import psycopg2 as pg
from setup import dbname,user, host, password
import sqlalchemy as sa

In [38]:
df =pd.read_csv("titanic.csv")

In [39]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [78]:
df = df.rename(index =str, columns = {"Siblings/Spouses Aboard": "siblings_spouses_aboard","Parents/Children Aboard":"parents_children_aboard"})
df.index.names=["index"]
df.head()

,Survived,Pclass,Name,Sex,Age,siblings_spouses_aboard,parents_children_aboard,Fare
index,,,,,,,,
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [53]:
df.describe()

,Survived,Pclass,Age,siblings_spouses_aboard,parents_children_aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [64]:
pg_conn = pg.connect(dbname=dbname,user=user,host= host,password = password)

In [65]:
pg_conn

In [57]:
create_titanic_table = """
CREATE TYPE pclass AS ENUM ('1','2','3');
CREATE TYPE gender AS ENUM ('male','female');
CREATE TABLE titanic (
index SERIAL PRIMARY KEY,
Survived boolean,
Pclass pclass,
Name varchar(75),
Sex gender,
Age int,
siblings_spouse_aboard int,
parents_children_aboard int,
Fare float
);
"""

In [73]:
schema = """
index SERIAL PRIMARY KEY,
Survived boolean,
Pclass pclass,
Name varchar(75),
Sex gender,
Age int,
siblings_spouse_aboard int,
parents_children_aboard int,
Fare float
"""

In [66]:
pg_curs = pg_conn.cursor()

In [68]:
pg_curs.execute(create_titanic_table)
pg_conn.commit()

ProgrammingError: type "pclass" already exists

In [193]:
con = sa.create_engine("postgres://uriewcad:rdrch76oPCr9R4mhv79CXGdGkQ3xGP4p@stampy.db.elephantsql.com:5432/uriewcad")

In [194]:
df.to_csv("titanic1.csv")

In [195]:
#df.to_sql(name="titanic1",con=con)

In [239]:
pg_conn = pg.connect(dbname=dbname,user=user,host= host,password = password)
pg_curs = pg_conn.cursor()

In [240]:
pg_curs,pg_conn

(<cursor object at 0x7f4b6545eed0; closed: 0>,
 <connection object at 0x7f4b65180e88; dsn: 'user=uriewcad password=xxx dbname=uriewcad host=stampy.db.elephantsql.com', closed: 0>)

In [243]:
#results = pg_curs.execute('SELECT index FROM titanic1 LIMIT 20;')
results = pg_curs.execute('SELECT "Pclass" FROM titanic1 LIMIT 20;')

In [244]:
pg_curs.fetchall()

[(3,),
 (1,),
 (3,),
 (1,),
 (3,),
 (3,),
 (1,),
 (3,),
 (3,),
 (2,),
 (3,),
 (1,),
 (3,),
 (3,),
 (3,),
 (2,),
 (3,),
 (2,),
 (3,),
 (3,)]

In [238]:
pg_conn.close()

In [233]:
pg_curs.close()